html/env.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>env</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="env"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-03-31T16:13+0800"/>
<meta name="author" content="ZHAO Xin"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/default.css"/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">env</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">OS</a>
<ul>
<li><a href="#sec-1-1">linux tool list</a></li>
<li><a href="#sec-1-2">archlinux</a>
<ul>
<li><a href="#sec-1-2-1">skype sound</a></li>
<li><a href="#sec-1-2-2">wget下载pacman</a></li>
<li><a href="#sec-1-2-3">chsdir的安装</a></li>
<li><a href="#sec-1-2-4">fbterm 的中文输入</a></li>
<li><a href="#sec-1-2-5">install fvwm</a></li>
<li><a href="#sec-1-2-6">软件依赖冲突</a></li>
<li><a href="#sec-1-2-7">自定义rox的快捷键</a></li>
<li><a href="#sec-1-2-8">安装</a></li>
<li><a href="#sec-1-2-9">配置</a></li>
<li><a href="#sec-1-2-10">输入时禁用 touchpad</a></li>
<li><a href="#sec-1-2-11">texlive use</a></li>
<li><a href="#sec-1-2-12">init5; firefox-&gt;2;</a></li>
</ul>
</li>
<li><a href="#sec-1-3">gentoo安装</a></li>
<li><a href="#sec-1-4">fvwm 托盘区</a></li>
<li><a href="#sec-1-5">fvwm-crystal</a></li>
<li><a href="#sec-1-6">win</a>
<ul>
<li><a href="#sec-1-6-1">休眠和唤醒</a>
<ul>
<li><a href="#sec-1-6-1-1">休眠</a></li>
<li><a href="#sec-1-6-1-2">唤醒</a></li>
</ul>
</li>
<li><a href="#sec-1-6-2">at命令</a></li>
<li><a href="#sec-1-6-3">avira广告去除</a></li>
<li><a href="#sec-1-6-4">win7自动登录</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">Office</a>
<ul>
<li><a href="#sec-2-1">word</a>
<ul>
<li><a href="#sec-2-1-1">叠字效果</a></li>
<li><a href="#sec-2-1-2">TOC域目录生成</a>
<ul>
<li><a href="#sec-2-1-2-1">证明材料目录的自动生成</a></li>
<li><a href="#sec-2-1-2-2">域开关</a></li>
</ul>
</li>
<li><a href="#sec-2-1-3">seq域和listnum域</a></li>
<li><a href="#sec-2-1-4">方框选中符号</a></li>
<li><a href="#sec-2-1-5">制表符使用2则</a></li>
<li><a href="#sec-2-1-6">网络打印机安装</a></li>
<li><a href="#sec-2-1-7">word博士模板</a></li>
<li><a href="#sec-2-1-8">ps 大字打印</a></li>
</ul>
</li>
<li><a href="#sec-2-2">TeX</a>
<ul>
<li><a href="#sec-2-2-1">bst file</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">OS</h2>
<div class="outline-text-2" id="text-1">

<p><a href="./part-resize.html">关于分区大小调整和备份</a>
</p>
</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">linux tool list</h3>
<div class="outline-text-3" id="text-1-1">

<p>guake terminal, byubo, tmux
nautilus actions
top shelf
cairo
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">archlinux &nbsp;&nbsp;&nbsp;<span class="tag"><span class="arch">arch</span></span></h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">skype sound</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>cat .pulse/client.conf
autospawn=no
pkill pulseaudio
skype 配置声音(这时用的alsa)
</p>
<p>
Restore ALSA Mixer settings at startup
alsactl -f /var/lib/alsa/asound.state store
add alsa to rc.conf or add following to rc.local
alsactl -f /var/lib/alsa/asound.state restore
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">wget下载pacman</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>XferCommand = /usr/bin/wget &ndash;passive-ftp -c -O %o %u
</p></div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">chsdir的安装</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>yaourt 过期.
下载最新源包, pacman 安装 bash-completion, chsdir 首行的 python 改成 python2
</p>
</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">fbterm 的中文输入</h4>
<div class="outline-text-4" id="text-1-2-4">

<p>ibus-fbterm 总是无法正常使用.
yaourt 安装 yong (小小输入法), 修改配置文件, 仅使用拼音和五笔. 
Ctrl + Space 关闭输入法再打开, 如果不能输入, 可 Ctrl + Shift 切换出来输入法.
</p>
<p>
----
总结: 多阅读 man 和自带 doc 文档, 阅读软件主页说明.
</p></div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5">install fvwm</h4>
<div class="outline-text-4" id="text-1-2-5">

<p>安装了fvwm, awesome (yaourt). 但无法起动awesome, 因为没有安装xorg. 安装xorg-server, xorg-xinit, xorg-utils, xf86-video-intel, 可以起动了.
</p>
</div>

</div>

<div id="outline-container-1-2-6" class="outline-4">
<h4 id="sec-1-2-6">软件依赖冲突</h4>
<div class="outline-text-4" id="text-1-2-6">

<p>ssh 翻墙，安装openssh时2个软件包有冲突，需要用pacman -Syu解决. 
</p>
</div>

</div>

<div id="outline-container-1-2-7" class="outline-4">
<h4 id="sec-1-2-7">自定义rox的快捷键</h4>
<div class="outline-text-4" id="text-1-2-7">

<p>修改~/.gtkrc-2.0
gtk<sub>can</sub><sub>change</sub><sub>accels</sub>=1
</p>
<p>
a*** aliedit
支付宝安全控件直接安装不起作用，网上查得信息并成功安装：
</p><ol>
<li>.aliedit/下log文件可知安装过程，是在.mozilla/plugins下copy一个库文件。
</li>
<li>ldd 该库文件知链接中的库文件libpng12没有。
</li>
<li>arch版本更新快，libpng已是14。
</li>
<li>用yaourt安装aliedit，可自动进行libpng12的下载、编译安装。
</li>
</ol>

</div>

</div>

<div id="outline-container-1-2-8" class="outline-4">
<h4 id="sec-1-2-8">安装</h4>
<div class="outline-text-4" id="text-1-2-8">

<p>使用 UNetbootin 将 iso 写入优盘，优盘启动引导，提示找不到盘符。
</p>
<p>
这是因为 arch 安装程序按照 LABEL 找 iso 文件。这时需先修改启动参数，增加
</p><pre class="example">
archisolabel=ARCH_201005
</pre>


<p>
再如下手动加载iso：
</p>


<pre class="src src-shell-script">mkdir /iso
mount -t ext3 /dev/sda7 /iso
modprobe loop
losetup /dev/loop6
ln -s /dev/loop6 /dev/disk/by-label/ARCH_201005
</pre>


<p>
Ctrl-D退出后，即可进入安装界面。
</p>
</div>

</div>

<div id="outline-container-1-2-9" class="outline-4">
<h4 id="sec-1-2-9">配置</h4>
<div class="outline-text-4" id="text-1-2-9">


<p>
添加用户
</p><pre class="example">
useradd -m -g users -G audio,lp,optical,storage,video,wheel,games,power -s /bin/bash archie
</pre>


<p>
eth0="dhcp"
wlan0="dhcp"
wlan<sub>wlan0</sub>="wlan0 essid MyEssid" # Unencrypted
#wlan<sub>wlan0</sub>="wlan0 essid MyEssid key 1234567890" # hex WEP key
#wlan<sub>wlan0</sub>="wlan0 essid MyEssid key s:asciikey" # ascii WEP key
INTERFACES=(eth0 wlan0)
</p>
<p>
xorgcfg 
xorgconfig
</p></div>

</div>

<div id="outline-container-1-2-10" class="outline-4">
<h4 id="sec-1-2-10"><span class="done DONE">DONE</span> 输入时禁用 touchpad &nbsp;&nbsp;&nbsp;<span class="tag"><span class="touchpad">touchpad</span></span></h4>
<div class="outline-text-4" id="text-1-2-10">

<ul>
<li>State "DONE" <span class="timestamp-wrapper"> <span class="timestamp">2010-09-14 二 17:19</span></span>

<p>
     使用以下命令，效果强过图形界面设置。
</p></li>
</ul>




<pre class="src src-shell-script">syndaemon -d -i 3 -t
</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">-d</td><td class="left">daemon 模式</td></tr>
<tr><td class="left">-t</td><td class="left">仅禁用点击、滚动，可以移动鼠标</td></tr>
<tr><td class="left">-i 3</td><td class="left">键盘释放3秒后恢复 touchpad 功能</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-1-2-11" class="outline-4">
<h4 id="sec-1-2-11"><span class="done DONE">DONE</span> texlive use &nbsp;&nbsp;&nbsp;<span class="tag"><span class="LINUX">LINUX</span></span></h4>
<div class="outline-text-4" id="text-1-2-11">

<p>pacman 安装了 arch 系统的一些 texlive 软件包，发现宏包不全，且没有 tlmgr 的在线安装宏包功能。
缷载软件包后，又用texlive的网络安装功能重新安装系统，适当多选了些软件组。
</p>
<p>
重新编译我的答辩幻灯，xeCJK的参数设置又有变化，缺slashbox宏包，且CTAN上也没有。
单独下载了slashbox宏包，放在/usr/local/texlive/texmf-local/tex/latex/local/下面，再texhash即可。
</p></div>

</div>

<div id="outline-container-1-2-12" class="outline-4">
<h4 id="sec-1-2-12"><span class="done DONE">DONE</span> init5; firefox-&gt;2; &nbsp;&nbsp;&nbsp;<span class="tag"><span class="LINUX">LINUX</span></span></h4>
<div class="outline-text-4" id="text-1-2-12">

<ul>
<li>命令行方式的自动登录到fvwm，参见<a href="https://wiki.archlinux.org/index.php/Start_X_at_Boot">https://wiki.archlinux.org/index.php/Start_X_at_Boot</a>
<ol>
<li>小c程序：autologin
</li>
<li>.bash<sub>profile</sub>: startx
</li>
</ol>

</li>
<li>Style StartsOnDesk 0 
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">gentoo安装 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="gentoo">gentoo</span></span></h3>
<div class="outline-text-3" id="text-1-3">


<p>
X -retro -config /root/xorg.conf.new
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="done DONE">DONE</span> fvwm 托盘区 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="_HOME">@HOME</span>&nbsp;<span class="LINUX">LINUX</span></span></h3>
<div class="outline-text-3" id="text-1-4">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2011-08-17 三 22:37</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2011-08-17 三 22:37</span></span>
        $ sudo apt-get install trayer
        $ trayer &ndash;widthtype pixel &ndash;width 128 &ndash;height 32 &ndash;edge bottom &amp;
</li>
</ul>


<p>
已经困扰我好几天的问题了，想在fvwm里面使用托盘，但是老是不成功，试了好几个tray程
序，如trayer等，都不能完美的swallow。但是单独使用是没有问题的。但我希望能swallow
到fvwmbuttons里面（因为我用的fvwmbuttons做的taskbar)。今天再次仔细的阅读了
stalonetray的man页。然后终于成功了，HOHO，非常的完美，只需要一个参数p参数就OK。表
示使用父颜色。如下： *FvwmTopBar: (100×25+885+0,Swallow(NoClose, UseOld)
`stalonetray` `Exec exec stalonetray -p`)
</p></div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="done DONE">DONE</span> fvwm-crystal</h3>
<div class="outline-text-3" id="text-1-5">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2011-08-28 日 20:00</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2011-08-28 日 20:00</span></span>
</li>
<li>keyboard-modifier
</li>
<li>fvwm-crystal.apps
</li>
</ul>

<p>python2; with&ndash;&gt;without; recipes: with&ndash;&gt;without
</p><ul>
<li>Script-Clock: default to 24-mode
</li>
<li>userconfig
</li>
<li>bindings: Pager
</li>
<li>recipe: 
<ol>
<li>EdgeRistance
</li>
<li>app-menu static
</li>
<li>$[fvwm<sub>font]</sub>
</li>
<li>remove numpad bindings
</li>
<li>Pager
</li>
</ol>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">win</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">休眠和唤醒</h4>
<div class="outline-text-4" id="text-1-6-1">


</div>

<div id="outline-container-1-6-1-1" class="outline-5">
<h5 id="sec-1-6-1-1">休眠</h5>
<div class="outline-text-5" id="text-1-6-1-1">

<ol>
<li>控制面板-电源-休眠功能-开启
</li>
<li>关机界面按 Shift, 待机变成休眠
</li>
<li>自动休眠命令
</li>
</ol>




<pre class="example">at 11:30 rundll32.exe powrprof.dll,SetSuspendState
</pre>

</div>

</div>

<div id="outline-container-1-6-1-2" class="outline-5">
<h5 id="sec-1-6-1-2">唤醒</h5>
<div class="outline-text-5" id="text-1-6-1-2">

<p>bios-apm-power RTC alarm from S5 <b>enable</b>
</p></div>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">at命令</h4>
<div class="outline-text-4" id="text-1-6-2">

<ol>
<li>时间格式只有时分，时期和星期需要用 <code>/next:</code> 和 <code>/every:</code> 来指定。
</li>
<li>命令行命令如 <code>del</code> 等前面需要加 <code>cmd /c</code> ，否则无法执行。
</li>
</ol>

</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3">avira广告去除</h4>
<div class="outline-text-4" id="text-1-6-3">

<p>组策略-windows设置-安全设置-软件限制策略-其它规则-新建
</p>
<p>
<code>c:\Program Files\Avira\AntiVir Desktop\avnotify.exe</code>
</p>
<p>
&lt;=c:\Program Files\Avira\AntiVir Desktop\avnotify.dll=
</p>
</div>

</div>

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4">win7自动登录</h4>
<div class="outline-text-4" id="text-1-6-4">

<p><code>control userpasswords2</code>
<code>netplwiz</code>
</p></div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Office</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">word</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">叠字效果</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>在表格中，需要选中方框时。
</p><ol>
<li>重叠的两个无边框文本框，每个里面1个字
</li>
<li>前1个字的字符间距，紧缩12磅（5号字）
</li>
<li>{eq \o (a,b)}
</li>
</ol>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">TOC域目录生成</h4>
<div class="outline-text-4" id="text-2-1-2">


</div>

<div id="outline-container-2-1-2-1" class="outline-5">
<h5 id="sec-2-1-2-1">证明材料目录的自动生成</h5>
<div class="outline-text-5" id="text-2-1-2-1">


<p class="verse">
{TC 目录中文字 \f a \l 1}<br/>
{TOC \f a \h}<br/>
</p>


<p>
前者做a类型隐藏标记, 后者根据其生成目录. \l表示目录文字采用"目录1"样式, \h表示加超链接.
</p>
<p>
可以先按顺序做好文字序列, 再Alt+Shift+o生成TC域, 插入图, 自动生成目录.
</p>
</div>

</div>

<div id="outline-container-2-1-2-2" class="outline-5">
<h5 id="sec-2-1-2-2">域开关</h5>
<div class="outline-text-5" id="text-2-1-2-2">

<p>TOC域通过下面的开关创建目录:
</p>
<p class="verse">
\f 目录项<br/>
\o 标题级别<br/>
\u 大纲级别<br/>
\a 题注<br/>
\b 书签<br/>
\c seq域 \s页前加章节号,\d章节号和页号分隔符<br/>
\t 样式<br/>
</p>


<p>
其它的开关选项有:
</p>
<p class="verse">
\p 目录名和页码之间分隔符<br/>
\w 保留制表符项<br/>
\x 保留换行符<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">seq域和listnum域</h4>
<div class="outline-text-4" id="text-2-1-3">

<p>域字体格式可和正文一样用样式确定. 
数字的样式listnum域比seq域复杂, 默认三种表里, 各9个级别. 还可以用多级符号制作自己的表.
</p>

<p class="verse">
listnum \l level \s startNum<br/>
</p>


</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4">方框选中符号</h4>
<div class="outline-text-4" id="text-2-1-4">

<p>格式－中文－带圈符号
</p></div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5">制表符使用2则</h4>
<div class="outline-text-4" id="text-2-1-5">

<ol>
<li>目录使用的是右对齐，前导&hellip;的制表符
</li>
<li>落款使用的是合适位置居中对齐的制表符
</li>
</ol>

</div>

</div>

<div id="outline-container-2-1-6" class="outline-4">
<h4 id="sec-2-1-6">网络打印机安装</h4>
<div class="outline-text-4" id="text-2-1-6">

<ol>
<li>连接－属性－TCP/IP－属性－高级－WINS－启用NetBios
</li>
<li>连接－属性－安装－服务－Microsoft网络的文件和打印机共享
</li>
<li>连接－属性－高级－防火墙－例外，中有文件和打印机共享
</li>
<li>服务－Computer Browser 启动
</li>
</ol>


<hr/>
<ol>
<li>启动Guest来宾帐户
</li>
<li>计算机管理－系统工具－本地用户和组－用户－Guest账户：全取消
</li>
</ol>


<hr/>
<ol>
<li>gpedit.msc－本地计算机策略－计算机配置－Windows配置－安全设置－本地策略－用户权利指派，拒绝从网络访问；从网络访问
</li>
<li>接上，本地安全策略－用户权限指派，空密码用户
</li>
</ol>


<hr/>
<ol>
<li>计算机属性－网络ID，改成不使用域，工作组GROUP309
</li>
<li>regedit, HKEY<sub>LOCAL</sub><sub>MACHINE\SYSTEM\CurrentControlSet\Control\Lsa</sub> 上将此子健中的值 restrictanonymous设为0就行了
</li>
</ol>


<p>
补充说明
</p><ul>
<li>host文件，fsmgmt.msc可以查看目前共享
</li>
<li>本地安全策略中：经典登录
</li>
<li>文件夹选项－简单文件共享
</li>
<li>文件夹权限
</li>
</ul>


</div>

</div>

<div id="outline-container-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="done DONE">DONE</span> word博士模板</h4>
<div class="outline-text-4" id="text-2-1-7">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2011-08-14 日 16:01</span></span><br/>
</p><ul>
<li>State "DONE"       from "HANGUP" <span class="timestamp-wrapper"> <span class="timestamp">2011-08-14 日 16:01</span></span>
</li>
<li>word 常用域
</li>
</ul>

<p>{FORMTEXT}
{TOC \t "NUDT标题1,1,NUDT标题2,2,NUDT标题3,3" \h}
{TOC \t "NUDT表" \c \h}
</p>
</div>

</div>

<div id="outline-container-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="done DONE">DONE</span> ps 大字打印</h4>
<div class="outline-text-4" id="text-2-1-8">

<ul>
<li>State "DONE" <span class="timestamp-wrapper"> <span class="timestamp">2011-03-06 日 09:38</span></span>
</li>
</ul>

<p>word excel 联手打大字。比如在Word A4页面中打一个汉字，
放大到这一个字满幅（可先选中这个字，Ctrl+］），复制，
到Excel中选择性粘贴为图片，拖大到四张A4幅面大小即可打印了。
（可以将Excel预览一下，视图调成25%左右大小）
</p>
<p>
第1步，打开Word2003窗口，输入一个汉字，并设置字号使其满屏（在Word中一般设置为500号字比较合适）页面中输入一个汉字。
第2步，选中该大字并执行“复制”操作，然后打开Excel窗口，在菜单栏依次单击“编辑”→“选择性粘贴”菜单命令，打开“选择性粘贴”对话框。在“方式”列表框中选中“图片（增强型图元文件）”选项，并单击“确定”按钮，如图2008071001所示。
第3步，在Excel窗口中设置执行为A4，并设置显示比例为25%。然后拖动大字图片周围的控制块调整其大小，使其符合几张A4纸型的幅面即可打印，如图2008071002所示。
</p>
<p>
借助于专门的海报打印软件来解决
</p>
<p>
office2003也有类似的功能~有专门的超大字打印程序
</p></div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">TeX</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">bst file &nbsp;&nbsp;&nbsp;<span class="tag"><span class="bst">bst</span></span></h4>
<div class="outline-text-4" id="text-2-2-1">


<p>
    bst文件中STRINGS变量不能超过20.
</p></div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-03-31T16:13+0800</p>
<p class="author">Author: ZHAO Xin</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
